### Database Connection

In [11]:
%reload_ext sql
%config SqlMagic.style = '_DEPRECATED_DEFAULT'
%sql mysql+pymysql://root:Bhavesh%402025@localhost/customers

### Test Connection

In [12]:
%%sql 
 SELECT version();

 * mysql+pymysql://root:***@localhost/customers
1 rows affected.

[('8.0.42',)]

###  SELECT 
- SELECT defines which columns you want to analyze
- It does not modify data
- Multiple columns can be selected

### Display all columns and all rows from the customers table.

In [13]:
%%sql
select * from customers;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[(1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15)),
 (3, 'Aman', 'Pune', 22, datetime.date(2023, 3, 1)),
 (4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20)),
 (5, 'Karan', 'Bangalore', 31, datetime.date(2023, 4, 5))]

### Display the customer name and city, but:
- Rename name as customer_name
- Rename city as location

In [14]:
%%sql 
select name as customer_name,
city as location from customers;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('Rahul', 'Mumbai'),
 ('Ananya', 'Delhi'),
 ('Aman', 'Pune'),
 ('Neha', 'Mumbai'),
 ('Karan', 'Bangalore')]

### Display the unique list of cities from the customers table.

In [15]:
%%sql 
select distinct city from customers;

 * mysql+pymysql://root:***@localhost/customers
4 rows affected.

[('Mumbai',), ('Delhi',), ('Pune',), ('Bangalore',)]

## ORDER BY – Sorting Data in SQL

The `ORDER BY` clause is used to **sort query results** based on one or more columns.

By default, data is sorted in **ascending order (ASC)**.
Descending order can be specified using **DESC**.

Sorting is commonly used in data analysis to:
- Rank users or products
- Find top or bottom records
- Prepare ordered reports and dashboards

### Display customer name, city, and signup date, sorted by most recent signup first.

In [26]:
%%sql 
SELECT name,city,signup_date FROM customers
order by signup_date desc;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('Karan', 'Bangalore', datetime.date(2023, 4, 5)),
 ('Aman', 'Pune', datetime.date(2023, 3, 1)),
 ('Ananya', 'Delhi', datetime.date(2023, 2, 15)),
 ('Neha', 'Mumbai', datetime.date(2023, 1, 20)),
 ('Rahul', 'Mumbai', datetime.date(2023, 1, 10))]

### Display customer name and age, sorted by age in descending order (oldest first).

In [22]:
%%sql
SELECT name,age FROM customers
ORDER BY age DESC;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[('Karan', 31), ('Neha', 29), ('Ananya', 27), ('Rahul', 24), ('Aman', 22)]

### Sort customers:
1.First by city (A–Z)  
2.Then by age (youngest to oldest) within each city

In [29]:
%%sql
select * from customers 
order by city asc, age asc ;

 * mysql+pymysql://root:***@localhost/customers
5 rows affected.

[(5, 'Karan', 'Bangalore', 31, datetime.date(2023, 4, 5)),
 (2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15)),
 (1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20)),
 (3, 'Aman', 'Pune', 22, datetime.date(2023, 3, 1))]

## LIMIT – Restricting Query Results

The `LIMIT` clause is used to **restrict the number of rows** returned by a query.

It is commonly used to:
- View sample data
- Show top records
- Improve query readability

`LIMIT` is usually combined with `ORDER BY`.

### Display only the first 3 customers from the customers table

In [30]:
%%sql 
select * from customers
limit 3 ;

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[(1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15)),
 (3, 'Aman', 'Pune', 22, datetime.date(2023, 3, 1))]

### Display the top 3 oldest customers with their name and age.

In [31]:
%%sql
select * from customers 
order by age desc limit 3 ;

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[(5, 'Karan', 'Bangalore', 31, datetime.date(2023, 4, 5)),
 (4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20)),
 (2, 'Ananya', 'Delhi', 27, datetime.date(2023, 2, 15))]

### Display the 2 most recently signed-up customers with their name and signup date.

In [32]:
%%sql 
select name ,signup_date from customers 
order by signup_date limit 3 ;

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Rahul', datetime.date(2023, 1, 10)),
 ('Neha', datetime.date(2023, 1, 20)),
 ('Ananya', datetime.date(2023, 2, 15))]

### Display the first 3 customers alphabetically by name.

In [34]:
%%sql 
select name from customers 
order by name asc limit 3;

 * mysql+pymysql://root:***@localhost/customers
3 rows affected.

[('Aman',), ('Ananya',), ('Karan',)]

## WHERE – Filtering Rows in SQL

The `WHERE` clause is used to **filter rows** based on one or more conditions.

It allows you to:
- Select only relevant data
- Reduce dataset size
- Apply business rules to queries

Without `WHERE`, SQL returns **all rows** from a table.

### Display all customers who live in Mumbai.

In [41]:
%%sql 
select * from customers
where city='Mumbai' ;

 * mysql+pymysql://root:***@localhost/customers
2 rows affected.

[(1, 'Rahul', 'Mumbai', 24, datetime.date(2023, 1, 10)),
 (4, 'Neha', 'Mumbai', 29, datetime.date(2023, 1, 20))]